 IQIVPF:  PROC OPTIONS(MAIN);
    Declare I fixed;
    Put Skip List ('IQIVPF   starting');
    Put Skip List ('IQIVPF   executing');
    Do I = 1 to 2;
      Put Skip List ('IQIVPF   incrementing I');
    End;
    Put Skip List ('IQIVPF   terminating');
 END;
